{
  "_name_or_path": "/LOCAL2/zhenglin/LISA/ck/SIDA-7B",
  "architectures": [
    "SIDAForCausalLM"
  ],
  "bos_token_id": 1,
  "eos_token_id": 2,
  "fc_hidden_size": 1408,
  "freeze_mm_mlp_adapter": true,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "image_aspect_ratio": "square",
  "image_grid_pinpoints": null,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "llm_input_size": 1024,
  "max_position_embeddings": 2048,
  "max_sequence_length": 2048,
  "mm_hidden_size": 1024,
  "mm_use_im_patch_token": false,
  "mm_use_im_start_end": true,
  "mm_vision_select_feature": "patch",
  "mm_vision_select_layer": -2,
  "mm_vision_tower": "openai/clip-vit-large-patch14",
  "model_type": "llava_sida",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "out_dim": 256,
  "pad_token_id": 0,
  "pretrain_mm_mlp_adapter": null,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "train_mask_decoder": true,
  "transformers_version": "4.31.0",
  "tune_mm_mlp_adapter": false,
  "use_cache": false,
  "use_mm_proj": true,
  "vision_hidden_size": 256,
  "vision_tower": "openai/clip-vit-large-patch14",
  "vocab_size": 32006
}
