{
  "metadata": {
    "total_size": 16155646156
  },
  "weight_map": {
    "lm_head.weight": "pytorch_model-00002-of-00002.bin",
    "model.attention_layer.in_proj_bias": "pytorch_model-00002-of-00002.bin",
    "model.attention_layer.in_proj_weight": "pytorch_model-00002-of-00002.bin",
    "model.attention_layer.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.attention_layer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.cls_head.0.0.bias": "pytorch_model-00002-of-00002.bin",
    "model.cls_head.0.0.weight": "pytorch_model-00002-of-00002.bin",
    "model.cls_head.0.3.bias": "pytorch_model-00002-of-00002.bin",
    "model.cls_head.0.3.weight": "pytorch_model-00002-of-00002.bin",
    "model.embed_tokens.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.23.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.24.input_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.mlp.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.mlp.gate_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.mlp.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.post_attention_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.self_attn.o_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00002.bin",
    "model.layers.24.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.input_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.mlp.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.mlp.gate_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.mlp.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.post_attention_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.self_attn.o_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00002.bin",
    "model.layers.25.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.input_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.mlp.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.mlp.gate_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.mlp.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.post_attention_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.self_attn.o_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00002.bin",
    "model.layers.26.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.input_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.mlp.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.mlp.gate_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.mlp.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.post_attention_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.self_attn.o_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00002.bin",
    "model.layers.27.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.input_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.mlp.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.mlp.gate_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.mlp.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.post_attention_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.self_attn.o_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00002.bin",
    "model.layers.28.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.input_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.mlp.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.mlp.gate_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.mlp.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.post_attention_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.self_attn.o_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00002.bin",
    "model.layers.29.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.3.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.3.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.30.input_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.mlp.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.mlp.gate_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.mlp.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.post_attention_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.self_attn.o_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00002.bin",
    "model.layers.30.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.input_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.mlp.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.mlp.gate_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.mlp.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.post_attention_layernorm.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.self_attn.k_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.self_attn.o_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.self_attn.q_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00002.bin",
    "model.layers.31.self_attn.v_proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.layers.4.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.4.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.5.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.6.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.7.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.8.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.9.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.mm_projector.bias": "pytorch_model-00002-of-00002.bin",
    "model.mm_projector.weight": "pytorch_model-00002-of-00002.bin",
    "model.norm.weight": "pytorch_model-00002-of-00002.bin",
    "model.sida_fc1.bias": "pytorch_model-00002-of-00002.bin",
    "model.sida_fc1.weight": "pytorch_model-00002-of-00002.bin",
    "model.text_hidden_fcs.0.0.bias": "pytorch_model-00002-of-00002.bin",
    "model.text_hidden_fcs.0.0.weight": "pytorch_model-00002-of-00002.bin",
    "model.text_hidden_fcs.0.2.bias": "pytorch_model-00002-of-00002.bin",
    "model.text_hidden_fcs.0.2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.0.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.1.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.10.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.11.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.12.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.13.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.14.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.15.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.16.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.17.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.18.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.19.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.2.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.20.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.norm1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.norm1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.norm2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.21.norm2.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.attn.proj.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.attn.proj.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.attn.qkv.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.attn.qkv.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.attn.rel_pos_h": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.attn.rel_pos_w": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.mlp.lin1.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.mlp.lin1.weight": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.mlp.lin2.bias": "pytorch_model-00002-of-00002.bin",
    "model.visual_model.image_encoder.blocks.22.mlp.lin2.weight": "pytorch_model-00002-of-00002.bin",
