{
  "add_cross_attention": false,
  "architectures": [
    "CLIPVisionModel"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": null,
  "cross_attention_hidden_size": null,
  "decoder_start_token_id": null,
  "dropout": 0.0,
  "dtype": "float32",
  "eos_token_id": null,
  "finetuning_task": null,
  "hidden_act": "quick_gelu",
  "hidden_size": 1024,
  "image_size": 224,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "is_decoder": false,
  "layer_norm_eps": 1e-05,
  "model_type": "clip_vision_model",
  "num_attention_heads": 16,
  "num_channels": 3,
  "num_hidden_layers": 24,
  "pad_token_id": null,
  "patch_size": 14,
  "prefix": null,
  "projection_dim": 768,
  "pruned_heads": {},
  "sep_token_id": null,
  "task_specific_params": null,
  "tie_encoder_decoder": false,
  "tie_word_embeddings": true,
  "tokenizer_class": null,
  "torchscript": false,
  "transformers_version": "5.3.0",
  "use_bfloat16": false
}
